app/controllers/api/v1/articles_controller.rb

SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` IS NULL ORDER BY `articles`.`id` DESC
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` IN (1, 2)
---
	def index
		articles = Article.includes(:category, :user).where( :user_id => current_user ).all.order(:id => "DESC")

INSERT INTO `articles` (`category_id`, `user_id`, `title`, `post_body`, `created_at`, `updated_at`) VALUES (1, 1, 'Ruby on Rails API Development', 'This is first post on Ruby on Rails', '2017-02-18 19:14:54', '2017-02-18 19:14:54')
---
	def create
		article = Article.new(article_params)
		article.user_id = current_user.id
		if article.save

UPDATE `articles` SET `category_id` = 2, `updated_at` = '2017-02-19 03:43:24' WHERE `articles`.`id` = 1
---
	def update
		if article = set_article
			if article.update(article_params)

DELETE FROM `articles` WHERE `articles`.`id` = 2
---
	def destroy
		if article = set_article
			if article.destroy

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 2 AND `articles`.`user_id` = 1 ORDER BY `articles`.`id` ASC LIMIT 1
---
		def set_article
			article = Article.where(:id => params[:id]).where(:user_id => current_user.id ).first