app/controllers/api/v1/categories_controller.rb

SELECT `categories`.`id`, `categories`.`name` FROM `categories` ORDER BY `categories`.`id` DESC
---
	def index
		categories = Category.all.select(:id, :name).order(:id => "DESC")

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('Amazon Web Services', '2017-02-18 18:50:09', '2017-02-18 18:50:09')
---
	def create
		category = Category.new(category_params)
		if category.save

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 ORDER BY `categories`.`id` ASC LIMIT 1
UPDATE `categories` SET `name` = 'Ruby on Rails APIs', `updated_at` = '2017-02-18 18:56:07' WHERE `categories`.`id` = 1
---
	def update
		if category = Category.where(:id => params[:id]).first
			if category.update(category_params)