app/controllers/api/v1/users_controller.rb

INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `name`) VALUES ('kiran@7edge.com', '$2a$11$2Rz87kdIpMDXTHwq78PUNeigetnY5ZxHabmKzp5VKtimak9d/TNP2', '2017-02-19 08:00:33', '2017-02-19 08:00:33', 'Kiran')
---
  def create
  	if !params[:user].nil? && params[:user].present?
	  	user = User.new(user_params)
	  	if user.save

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'harisha.v@7edge.com' ORDER BY `users`.`id` ASC LIMIT 1
---
  def login
  	user = User.where( :email => params[:email]).first